## Terraform Plan
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 4 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                         NAME                                          |
|--------|---------------------------------------------------------------------------------------|
| add    | `module.saas_app_service_principal.azuread_application.sp_app[0]`                     |
|        | `module.saas_app_service_principal.azuread_service_principal.sp[0]`                   |
|        | `module.saas_app_service_principal.azuread_service_principal_password.sp_password[0]` |
|        | `module.saas_app_service_principal.azurerm_role_assignment.role_assignment_sp[0]`     |
| update | `module.valentine_api_key.azurerm_cognitive_account.openai`                           |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.saas_app_service_principal.azuread_application.sp_app[0] will be created
  + resource "azuread_application" "sp_app" {
      + app_role_ids                = (known after apply)
      + client_id                   = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "saas-app-service_principal"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)

      + feature_tags (known after apply)
    }

  # module.saas_app_service_principal.azuread_service_principal.sp[0] will be created
  + resource "azuread_service_principal" "sp" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles                   = (known after apply)
      + application_tenant_id       = (known after apply)
      + client_id                   = (known after apply)
      + display_name                = (known after apply)
      + homepage_url                = (known after apply)
      + id                          = (known after apply)
      + logout_url                  = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + oauth2_permission_scopes    = (known after apply)
      + object_id                   = (known after apply)
      + redirect_uris               = (known after apply)
      + saml_metadata_url           = (known after apply)
      + service_principal_names     = (known after apply)
      + sign_in_audience            = (known after apply)
      + tags                        = (known after apply)
      + type                        = (known after apply)

      + feature_tags (known after apply)

      + features (known after apply)
    }

  # module.saas_app_service_principal.azuread_service_principal_password.sp_password[0] will be created
  + resource "azuread_service_principal_password" "sp_password" {
      + display_name         = (known after apply)
      + end_date             = (known after apply)
      + id                   = (known after apply)
      + key_id               = (known after apply)
      + service_principal_id = (known after apply)
      + start_date           = (known after apply)
      + value                = (sensitive value)
    }

  # module.saas_app_service_principal.azurerm_role_assignment.role_assignment_sp[0] will be created
  + resource "azurerm_role_assignment" "role_assignment_sp" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/0bbd06bc-48ac-48bc-9275-c0cbeebef3b6"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.valentine_api_key.azurerm_cognitive_account.openai will be updated in-place
  ~ resource "azurerm_cognitive_account" "openai" {
        id                                          = "/subscriptions/204b7832-86f3-4792-8e35-860862258324/resourceGroups/ctchvym-valentine/providers/Microsoft.CognitiveServices/accounts/valentine-ctchvym"
        name                                        = "valentine-ctchvym"
      ~ tags                                        = {
          - "division" = "DC" -> null
        }
        # (19 unchanged attributes hidden)
    }

Plan: 4 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["module.valentine_api_key.azurerm_cognitive_account.openai"]
WARN - plan.json - main - Missing Common Tags: ["module.valentine_api_key.azurerm_resource_group.rg"]

21 tests, 19 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
